In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Answer number 1

In [4]:
df['FlightNumber']=df['FlightNumber'].fillna(method='backfill')
df['FlightNumber']

0    10045.0
1    10065.0
2    10065.0
3    10085.0
4    10085.0
Name: FlightNumber, dtype: float64

In [5]:
df['FlightNumber'][1]=df['FlightNumber'][0]+10

<ipython-input-5-5d5744dc27d7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][1]=df['FlightNumber'][0]+10

In [6]:
df['FlightNumber'][3]=df['FlightNumber'][2]+10

<ipython-input-6-0490a67d57a1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][3]=df['FlightNumber'][2]+10

In [7]:
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

# Answers number 2

In [8]:
to=[]
From=[]
for x in df['From_To']:
    value_from=x.split("_")[0]
    From.append(value_from)
    value_to=x.split("_")[1]
    to.append(value_to)

In [9]:
From

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [10]:
to

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

# Now i am converting into words using uppercase()

In [11]:
From_couln=[]
for x in From:
    value1=x.capitalize()
    From_couln.append(value1)

In [12]:
From_to=[]
for y in to:
    value2=y.capitalize()
    From_to.append(value2)

In [13]:
df=df.drop(columns="From_To")

In [14]:
pd.DataFrame(From_to,From_couln)

                  0
London        Paris
Madrid        Milan
London    Stockholm
Budapest      Paris
Brussels     London

In [15]:
df['From']=From_couln

In [16]:
df['To']=From_to

In [17]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [25]:
new_rows=pd.DataFrame(df['RecentDelays'].values.tolist())

In [29]:
df['Delay1']=new_rows[0]
df['Delay2']=new_rows[1]
df['Delay3']=new_rows[2]

In [30]:
df

,FlightNumber,RecentDelays,Airline,From,To,Delay1,Delay2,Delay3
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [33]:
df=df.drop(['RecentDelays'],axis=1)

In [34]:
df

,FlightNumber,Airline,From,To,Delay1,Delay2,Delay3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN